yasserabdoulaye92/Projet_DEEP/drivers/bsp/APDS9960/stm32g4_apds9960.c
/**
 *******************************************************************************
 * @file 	stm32g4_apds9960.c
 * @author 	vchav
 * @date 	May 3, 2024
 * @brief	Module pour l'utilisation du capteur APDS9960
 *******************************************************************************
 */
/**
 * Ce pilote permet d'interfacer le capteur de luminosité RGB et de mouvement APDS9960.
 * Ce capteur permet de mesurer la luminosité ambiante, les luminosités de chacune des trois couleurs RGB, mais également de
 * détecter des mouvements tels qu'un "swipe" vers la droite par exemple ou encore de détecter un objet à proximité.
 * Les modes d'uilisation sont les suivants (et peuvent être activés en même temps) :
 *
 ************************************************************************************************************************
 * 	 1.	Mode "Capteur de luminosité" :
 *
 * 	 	    Permet de mesurer la luminosité ambiante et les niveaux de ses trois composantes RGB.
 *		    Il intègre lui même deux modes :
 *
 *			- Mode "Normal" : permet de faire une simple lecture des valeurs.
 *					1. Initialiser le capteur : init()
 *					2. Activer le capteur en mode capteur de luminosité : enableLightSensor(false)
 *					3. Lire les valeurs désirées : readAmbientLight();
 *												   readRedLight();
 *				                                   readBlueLight();
 *				                                   readGreenLight();
 *				    4. Ajouter un délai(250ms par ex) pour s'assurer que les mesures ont le temps de se faire.
 *
 *			- Mode Interruption : quand la luminosité est comprise dans un certain intervalle définit par l'utilisateur,
 *			  une interruption est déclenchée.
 *			  		1. Initialiser le capteur : init()
 *			  		2. Définir les seuils (inférieur et supérieur) d'interruption : setLightIntLowThreshold()
 *			  																		setLightIntHighThreshold()
 *			  		3. Activer le mode capteur de luminosité en autorisant les interruptions : enableLightSensor(true)
 *			  		4. Gérer les interruptions (initialisation de la broche de l'IT, activation des IT, routine d'interruption, etc).
 *			  		5. --!!!-- Après chaque interruption générée par une luminosité comprise dans l'intervalle défini
 *			  		   précédemment, ne pas oublier d'acquitter l'interruption : clearAmbientLightInt() ---!!!---
 *
 *************************************************************************************************************************
 *	 2.	Mode "Capteur de proximité" :
 *
 * 	 	    Permet de détecter un objet à proximité. Le capteur mesure le "niveau de proximité" qui correspond
 * 	 	    à une valeur sur 8 bits. Plus l'objet est proche, plus la valeur est élevée.
 *		    Tout comme le mode "Capteur de luminosité", il présente deux modes :
 *
 *			- Mode "Normal" : permet de faire une simple lecture du niveau de proximité.
 *					1. Initialiser le capteur : init()
 *					2. Activer le capteur en mode capteur de proximité : enableProximitySensor(false)
 *					3. Lire le niveau de proximité : readProximity()
 *					4. Ajouter un délai(250ms par ex) pour s'assurer que les mesures ont le temps de se faire.
 *
 *			- Mode Interruption : quand le niveau de proximité est compris dans un certain intervalle définit par l'utilisateur,
 *			  une interruption est déclenchée.
 *			  		1. Initialiser le capteur : init()
 *			  		2. Définir les seuils (inférieur et supérieur) d'interruption : setProximityIntLowThreshold()
 *			  																		setProximityIntHighThreshold()
 *			  		3. Activer le mode capteur de proximité en autorisant les interruptions : enableProximitySensor(true)
 *			  		4. Gérer les interruptions (initialisation de la broche de l'IT en mode interruption sur front descendant,
 *			  		   activation des IT, routine d'interruption, etc).
 *			  		5. --!!!-- Après chaque interruption générée par un niveau de proximité compris dans l'intervalle défini
 *			  		   précédemment, ne pas oublier d'acquitter l'interruption : clearProximityInt() ---!!!---
 *
 ***************************************************************************************************************************
 *   3.	Mode "Détecteur de mouvement" :
 *
 * 	 	    Permet de détecter certains gestes de l'utilisateur effectués au-dessus du capteur : balayages droite/gauche,
 * 	 	    gauche/droite, bas/haut, haut/bas, éloignement et rapprochement.
 *
 *					1. Initialiser le capteur : init()
 *					2. Initialiser la broche d'interruption en mode interruption sur front descendant.
 *					2. Activer le capteur en mode détecteur de mouvement en autorisant les IT : enableGestureSensor(true)
 *					3. Activer les interruptions.
 *					4. Créer une fonction permettant de traiter un geste détecté. Cette fonction vérifiera tout d'abord
 *					   la disponibilité d'un geste ( isGestureAvailable() ). Si un geste est bien disponible, on lit
 *					   le geste ( readGesture() ) et on fait l'action désirée en fonction du geste lu. A la fin de cette
 *					   fonction, veiller à REACTIVER LES IT qui ont temporairement été désactivées le temps de traiter
 *					   le geste détecté.
 *					5. Définir la routine d'interruption système, dans laquelle, après avoir acquitté l'IT,
 *					   on DESACTIVERA LES IT temporairement, le temps de traiter le mouvement ayant généré l'IT.
 *					6. Quand une IT a été levée, appeler la méthode de traitement de geste créée lors de l'étape 4
 *					   (dans la tâche de fond par exemple).
 *
 *
 *************************************************************************************************************************
 *
 * Par défaut, les broches utilisées sont celles de l'I2C1 : PA15 pour SCL et PB7 pour SDA.
 * Le basculement sur l'I2C2 ou l'I2C3 peut se faire en modifiant la macro APDS9960_I2C dans le .h.
 * |	I2C2 GPIO Configuration		|		I2C3 GPIO Configuration		|
   |	SDA  --> PF0-OSC_IN			|		SDA  --> PA8				|
   |	SCL  --> PA9				|		SCL  --> PB5				|
 * La broche d'interruption suggérée (INT) est PB6 (vous pouvez la changer par n'importe qu'elle GPIO car la stm32g4 avec les IT externes sur tous ses ports).
 * La broche Vl n'est pas branchée.
 * Le capteur est alimenté par sa broche Vcc en 3.3V.
 */

#include "config.h"
#if USE_APDS9960
#include "stm32g4_apds9960.h"
#include "stm32g4xx_hal.h"
#include "stm32g4_gpio.h"
#include "stm32g4_i2c.h"
#include "stm32g4_uart.h"
#include "stm32g4_utils.h"
#include "stdlib.h"
#include <stdio.h>


/* Private variables ---------------------------------------------------------*/
gesture_data_type gesture_data_;
int gesture_ud_delta_;
int gesture_lr_delta_;
int gesture_ud_count_;
int gesture_lr_count_;
int gesture_near_count_;
int gesture_far_count_;
int gesture_state_;
int gesture_motion_;


