yasserabdoulaye92/Projet_DEEP/drivers/bsp/APDS9960/stm32g4_apds9960.c
/* Private function prototypes -----------------------------------------------*/

/* Gesture processing */
void APDS9960_resetGestureParameters();
bool APDS9960_processGestureData();
bool APDS9960_decodeGesture();

/* Proximity Interrupt Threshold */
uint8_t APDS9960_getProxIntLowThresh();
void APDS9960_setProxIntLowThresh(uint8_t threshold);
uint8_t APDS9960_getProxIntHighThresh();
void APDS9960_setProxIntHighThresh(uint8_t threshold);

/* LED Boost Control */
uint8_t APDS9960_getLEDBoost();
void APDS9960_setLEDBoost(uint8_t boost);

/* Proximity photodiode select */
uint8_t APDS9960_getProxGainCompEnable();
void APDS9960_setProxGainCompEnable(uint8_t enable);
uint8_t APDS9960_getProxPhotoMask();
void APDS9960_setProxPhotoMask(uint8_t mask);

/* Gesture threshold control */
uint8_t APDS9960_getGestureEnterThresh();
void APDS9960_setGestureEnterThresh(uint8_t threshold);
uint8_t APDS9960_getGestureExitThresh();
void APDS9960_setGestureExitThresh(uint8_t threshold);

/* Gesture LED, gain, and time control */
uint8_t APDS9960_getGestureWaitTime();
void APDS9960_setGestureWaitTime(uint8_t time);

/* Gesture mode */
uint8_t APDS9960_getGestureMode();
void APDS9960_setGestureMode(uint8_t mode);

/* Raw I2C Commands */
void wireWriteByte(uint8_t val);
void wireWriteDataByte(uint8_t reg, uint8_t val);
void wireWriteDataBlock(uint8_t reg, uint8_t *val, unsigned int len);
void wireReadDataByte(uint8_t reg, uint8_t *val);
void wireReadDataBlock(uint8_t reg, uint8_t *val, unsigned int len);




/* Function definitions -----------------------------------------------*/

bool APDS9960_init() {
    uint8_t id;

    gesture_ud_delta_ = 0;
	gesture_lr_delta_ = 0;

	gesture_ud_count_ = 0;
	gesture_lr_count_ = 0;

	gesture_near_count_ = 0;
	gesture_far_count_ = 0;

	gesture_state_ = 0;
	gesture_motion_ = DIR_NONE;

    /* Initialize I2C */
    BSP_I2C_Init(APDS9960_I2C, STANDARD_MODE, true);

    /* Read ID register and check against known values for APDS-9960 */
    wireReadDataByte(APDS9960_ID, &id);

    if( !(id == APDS9960_ID_1 || id == APDS9960_ID_2) ) {
        return false;
    }

    /* Set ENABLE register to 0 (disable all features) */
    APDS9960_setMode(ALL, OFF);

    /* Set default values for ambient light and proximity registers */
    wireWriteDataByte(APDS9960_ATIME, DEFAULT_ATIME);
    wireWriteDataByte(APDS9960_WTIME, DEFAULT_WTIME);
    wireWriteDataByte(APDS9960_PPULSE, DEFAULT_PROX_PPULSE);
    wireWriteDataByte(APDS9960_POFFSET_UR, DEFAULT_POFFSET_UR);
    wireWriteDataByte(APDS9960_POFFSET_DL, DEFAULT_POFFSET_DL);
    wireWriteDataByte(APDS9960_CONFIG1, DEFAULT_CONFIG1);
    APDS9960_setLEDDrive(DEFAULT_LDRIVE);
    APDS9960_setProximityGain(DEFAULT_PGAIN);
    APDS9960_setAmbientLightGain(DEFAULT_AGAIN);
    APDS9960_setProxIntLowThresh(DEFAULT_PILT);
    APDS9960_setProxIntHighThresh(DEFAULT_PIHT);
    APDS9960_setLightIntLowThreshold(DEFAULT_AILT);
    APDS9960_setLightIntHighThreshold(DEFAULT_AIHT);
    wireWriteDataByte(APDS9960_PERS, DEFAULT_PERS);
    wireWriteDataByte(APDS9960_CONFIG2, DEFAULT_CONFIG2);
    wireWriteDataByte(APDS9960_CONFIG3, DEFAULT_CONFIG3);

    /* Set default values for gesture sense registers */
    APDS9960_setGestureEnterThresh(DEFAULT_GPENTH);
    APDS9960_setGestureExitThresh(DEFAULT_GEXTH);
    wireWriteDataByte(APDS9960_GCONF1, DEFAULT_GCONF1);
    APDS9960_setGestureGain(DEFAULT_GGAIN);
    APDS9960_setGestureLEDDrive(DEFAULT_GLDRIVE);
    APDS9960_setGestureWaitTime(DEFAULT_GWTIME);
    wireWriteDataByte(APDS9960_GOFFSET_U, DEFAULT_GOFFSET);
    wireWriteDataByte(APDS9960_GOFFSET_D, DEFAULT_GOFFSET);
    wireWriteDataByte(APDS9960_GOFFSET_L, DEFAULT_GOFFSET);
    wireWriteDataByte(APDS9960_GOFFSET_R, DEFAULT_GOFFSET);
    wireWriteDataByte(APDS9960_GPULSE, DEFAULT_GPULSE);
    wireWriteDataByte(APDS9960_GCONF3, DEFAULT_GCONF3);
    APDS9960_setGestureIntEnable(DEFAULT_GIEN);


    /* Gesture config register dump */
    uint8_t reg;
    uint8_t val;

    for(reg = 0x80; reg <= 0xAF; reg++) {
        if( (reg != 0x82) && \
            (reg != 0x8A) && \
            (reg != 0x91) && \
            (reg != 0xA8) && \
            (reg != 0xAC) && \
            (reg != 0xAD) )
        {
            wireReadDataByte(reg, &val);
//            Serial.print(reg, HEX);
//            Serial.print(": 0x");
//            Serial.println(val, HEX);
        }
    }

    for(reg = 0xE4; reg <= 0xE7; reg++) {
        wireReadDataByte(reg, &val);
//        Serial.print(reg, HEX);
//        Serial.print(": 0x");
//        Serial.println(val, HEX);
    }
    return true;
}

uint8_t APDS9960_getMode() {
    uint8_t enable_value;

    /* Read current ENABLE register */
    wireReadDataByte(APDS9960_ENABLE, &enable_value);

    return enable_value;
}

/*
 * @brief Cette demo initialise le capteur APDS9960 et effectue périodiquement une lecture des lumières Rouge, Verte et Bleu.
 * @post  Attention, cette fonction de démonstration est blocante et nécéssite un UART pour afficher les données !
 */
void APDS9960_demo_RGB(void)
{
	APDS9960_init();
	APDS9960_enableLightSensor(false);
	//APDS9960_setLEDDrive(1);
	while(1)
	{
		uint16_t ambiant, red, blue, green;
		APDS9960_readAmbientLight(&ambiant);
		APDS9960_readRedLight(&red);
		APDS9960_readBlueLight(&blue);
		APDS9960_readGreenLight(&green);


		if(ambiant)
		{
			blue = (uint16_t)(((uint32_t)blue*100)/ambiant);
			red = (uint16_t)(((uint32_t)red*100)/ambiant);
			green = (uint16_t)(((uint32_t)green*100)/ambiant);
		}
			printf("A:%d\tR:%d\tG:%d\tB:%d\n",ambiant, red, green, blue);
		HAL_Delay(500);

	}
}
/* ------------------------------------------------------------- */



/* ----------------------Setting functions---------------------- */
/**
 * @brief Activé ou désactivé un mode sur l'APDS-9960
 * @param mode: celui à configurer
 * @param enable: on l'active (1) ou on le désactive (0)
 */
void APDS9960_setMode(uint8_t mode, uint8_t enable) {
    uint8_t reg_val;

    /* Read current ENABLE register */
    reg_val = APDS9960_getMode();

    /* Change bit(s) in ENABLE register */
    enable = enable & 0x01;
    if( mode >= 0 && mode <= 6 ) {
        if (enable) {
            reg_val |= (1 << mode);
        } else {
            reg_val &= ~(1 << mode);
        }
    } else if( mode == ALL ) {
        if (enable) {
            reg_val = 0x7F;
        } else {
            reg_val = 0x00;
        }
    }

    /* Write value back to ENABLE register */
    wireWriteDataByte(APDS9960_ENABLE, reg_val);
}

/**
 * @brief Allume l'APDS-9960
 */
void APDS9960_enablePower() {
	APDS9960_setMode(POWER, 1);
}

/**
 * @brief Eteint l'APDS-9960
 */
void APDS9960_disablePower() {
	APDS9960_setMode(POWER, 0);
}

/**
 * @brief Active le mode capteur de lumière ambiante (R/G/B/Ambient).
 * @param interrupts: true pour activer l’interruption externe matérielle sur haute ou basse luminosité
 */
void APDS9960_enableLightSensor(bool interrupts) {
    /* Set default gain, interrupts, enable power, and enable sensor */
    APDS9960_setAmbientLightGain(DEFAULT_AGAIN);
    if(interrupts) {
        APDS9960_setAmbientLightIntEnable(1);
    } else {
        APDS9960_setAmbientLightIntEnable(0);
    }
    APDS9960_enablePower();
    APDS9960_setMode(AMBIENT_LIGHT, 1);
}

/**
 * @brief Désactive le mode capteur de lumière ambiante
 */
void APDS9960_disableLightSensor() {
	APDS9960_setAmbientLightIntEnable(0);
	APDS9960_setMode(AMBIENT_LIGHT, 0);
}

/**
 * @brief Active le mode capteur de proximité
 * @param interrupts: true pour activer l’interruption externe matérielle de proximité
 */
void APDS9960_enableProximitySensor(bool interrupts) {
    /* Set default gain, LED, interrupts, enable power, and enable sensor */
    APDS9960_setProximityGain(DEFAULT_PGAIN);
    APDS9960_setLEDDrive(DEFAULT_LDRIVE);
    if( interrupts ) {
        APDS9960_setProximityIntEnable(1);
    } else {
        APDS9960_setProximityIntEnable(0);
    }
    APDS9960_enablePower();
    APDS9960_setMode(PROXIMITY, 1);
}

/**
 * @brief Désactive le mode capteur de proximité
 */
void APDS9960_disableProximitySensor() {
	APDS9960_setProximityIntEnable(0);
	APDS9960_setMode(PROXIMITY, 0);
}

/**
 * @brief Active le mode reconnaissance de geste
 * @param interrupts: true pour activer l’interruption externe matérielle de geste
 */
void APDS9960_enableGestureSensor(bool interrupts) {
	/* Enable gesture mode
	   Set ENABLE to 0 (power off)
	   Set WTIME to 0xFF
	   Set AUX to LED_BOOST_300
	   Enable PON, WEN, PEN, GEN in ENABLE
	*/
	APDS9960_resetGestureParameters();
	wireWriteDataByte(APDS9960_WTIME, 0xFF);
	wireWriteDataByte(APDS9960_PPULSE, DEFAULT_GESTURE_PPULSE);
	APDS9960_setLEDBoost(LED_BOOST_300);
	if( interrupts ) {
		APDS9960_setGestureIntEnable(1);
	} else {
		APDS9960_setGestureIntEnable(0);
	}
	APDS9960_setGestureMode(1);
	APDS9960_enablePower();
	APDS9960_setMode(WAIT, 1);
	APDS9960_setMode(PROXIMITY, 1);
	APDS9960_setMode(GESTURE, 1);
}

/**
 * @brief Désactive le mode reconnaissance de geste/mouvement
 */
void APDS9960_disableGestureSensor() {
    APDS9960_resetGestureParameters();
    APDS9960_setGestureIntEnable(0);
    APDS9960_setGestureMode(0);
    APDS9960_setMode(GESTURE, 0);
}

/**
* @brief Réinitialise tous les paramètres du membre de données de mouvement
 */
void APDS9960_resetGestureParameters() {
    gesture_data_.index = 0;
    gesture_data_.total_gestures = 0;

    gesture_ud_delta_ = 0;
    gesture_lr_delta_ = 0;

