yasserabdoulaye92/Projet_DEEP/drivers/bsp/APDS9960/stm32g4_apds9960.c
    gesture_ud_count_ = 0;
    gesture_lr_count_ = 0;

    gesture_near_count_ = 0;
    gesture_far_count_ = 0;

    gesture_state_ = 0;
    gesture_motion_ = DIR_NONE;
}

/**
 * @brief Paramètre le seuil bas de détection de proximité
 * @param threshold: le seuil de proximité bas
 */
void APDS9960_setProxIntLowThresh(uint8_t threshold)
{
    wireWriteDataByte(APDS9960_PILT, threshold);
}

/**
 * @brief Paramètre le seuil haut de détection de proximité
 * @param threshold: le seuil de proximité haut
 */
void APDS9960_setProxIntHighThresh(uint8_t threshold)
{
    wireWriteDataByte(APDS9960_PIHT, threshold);
}

/**
 * @brief Définit la puissance de la LED pour la proximité et l'ALS
 *
 * Valeur   Courant de la LED
 *   0        100 mA
 *   1         50 mA
 *   2         25 mA
 *   3         12,5 mA
 *
 * @param drive: la valeur (0-3) pour la puissance de la LED
 */
void APDS9960_setLEDDrive(uint8_t drive)
{
    uint8_t val;

    /* Read value from CONTROL register */
    wireReadDataByte(APDS9960_CONTROL, &val);

    /* Set bits in register to given value */
    drive &= 0b00000011;
    drive = drive << 6;
    val &= 0b00111111;
    val |= drive;

    /* Write register value back into CONTROL register */
    wireWriteDataByte(APDS9960_CONTROL, val);
}

/**
 * @brief Définit le gain du récepteur pour la détection de proximité
 *
 * Valeur   Gain
 *   0       1x
 *   1       2x
 *   2       4x
 *   3       8x
 *
 * @param drive: la valeur (0-3) pour le gain
 */
void APDS9960_setProximityGain(uint8_t drive)
{
    uint8_t val;

    /* Read value from CONTROL register */
    wireReadDataByte(APDS9960_CONTROL, &val);

    /* Set bits in register to given value */
    drive &= 0b00000011;
    drive = drive << 2;
    val &= 0b11110011;
    val |= drive;

    /* Write register value back into CONTROL register */
    wireWriteDataByte(APDS9960_CONTROL, val);
}

/**
 * @brief Définit le gain du récepteur pour le capteur de lumière ambiante (ALS)
 *
 * Valeur   Gain
 *   0       1x
 *   1       4x
 *   2      16x
 *   3      64x
 *
 * @param drive: la valeur (0-3) pour le gain
 */
void APDS9960_setAmbientLightGain(uint8_t drive)
{
    uint8_t val;

    /* Read value from CONTROL register */
    wireReadDataByte(APDS9960_CONTROL, &val);

    /* Set bits in register to given value */
    drive &= 0b00000011;
    val &= 0b11111100;
    val |= drive;

    /* Write register value back into CONTROL register */
    wireWriteDataByte(APDS9960_CONTROL, val);
}

/**
 * @brief Définit la valeur d'amplification du courant de la LED
 *
 * Valeur   Courant d'amplification
 *   0        100%
 *   1        150%
 *   2        200%
 *   3        300%
 *
 * @param boost: la valeur (0-3) pour l'amplification du courant (100-300%)
 */
void APDS9960_setLEDBoost(uint8_t boost)
{
    uint8_t val;

    /* Read value from CONFIG2 register */
    wireReadDataByte(APDS9960_CONFIG2, &val);

    /* Set bits in register to given value */
    boost &= 0b00000011;
    boost = boost << 4;
    val &= 0b11001111;
    val |= boost;

    /* Write register value back into CONFIG2 register */
    wireWriteDataByte(APDS9960_CONFIG2, val);
}

/**
 * @brief Définit l'activation de la compensation du gain de proximité
 * @param enable: 1 pour activer la compensation. 0 pour désactiver la compensation.
 */
void APDS9960_setProxGainCompEnable(uint8_t enable)
{
   uint8_t val;

   /* Read value from CONFIG3 register */
   wireReadDataByte(APDS9960_CONFIG3, &val);

   /* Set bits in register to given value */
   enable &= 0b00000001;
   enable = enable << 5;
   val &= 0b11011111;
   val |= enable;

   /* Write register value back into CONFIG3 register */
   wireWriteDataByte(APDS9960_CONFIG3, val);
}

/**
 * @brief Définit le masque pour activer/désactiver les photodiodes de proximité
 * 1 = désactivé, 0 = activé
 * Bit    Photodiode
 *  3       HAUT
 *  2       BAS
 *  1       GAUCHE
 *  0       DROITE
 *
 * @param mask: valeur de masque de 4 bits
 */
void APDS9960_setProxPhotoMask(uint8_t mask)
{
    uint8_t val;

    /* Read value from CONFIG3 register */
    wireReadDataByte(APDS9960_CONFIG3, &val);

    /* Set bits in register to given value */
    mask &= 0b00001111;
    val &= 0b11110000;
    val |= mask;

    /* Write register value back into CONFIG3 register */
    wireWriteDataByte(APDS9960_CONFIG3, val);
}

/**
 * @brief Définit le seuil d'entrée de proximité pour la détection de gestes
 * @param threshold: valeur de proximité nécessaire pour démarrer le mode de détection de gestes
 */
void APDS9960_setGestureEnterThresh(uint8_t threshold)
{
    wireWriteDataByte(APDS9960_GPENTH, threshold);
}

/**
 * @brief Définit le seuil de sortie de proximité pour la détection de gestes
 * @param threshold: valeur de proximité nécessaire pour terminer le mode de détection de gestes
 */
void APDS9960_setGestureExitThresh(uint8_t threshold)
{
    wireWriteDataByte(APDS9960_GEXTH, threshold);
}

/**
 * @brief Définit le gain de la photodiode en mode geste
 * Valeur    Gain
 *   0       1x
 *   1       2x
 *   2       4x
 *   3       8x
 *
 * @param[in] gain la valeur du gain de la photodiode
 */
void APDS9960_setGestureGain(uint8_t gain)
{
    uint8_t val;

    /* Read value from GCONF2 register */
    wireReadDataByte(APDS9960_GCONF2, &val);

    /* Set bits in register to given value */
    gain &= 0b00000011;
    gain = gain << 5;
    val &= 0b10011111;
    val |= gain;

    /* Write register value back into GCONF2 register */
    wireWriteDataByte(APDS9960_GCONF2, val);
}

/**
 * @brief Définit le courant d'entraînement des LED en mode geste
 * Valeur    Courant LED
 *   0        100 mA
 *   1         50 mA
 *   2         25 mA
 *   3         12.5 mA
 *
 * @param[in] drive la valeur pour le courant d'entraînement des LED
 */
void APDS9960_setGestureLEDDrive(uint8_t drive)
{
    uint8_t val;

    /* Read value from GCONF2 register */
    wireReadDataByte(APDS9960_GCONF2, &val);

    /* Set bits in register to given value */
    drive &= 0b00000011;
    drive = drive << 3;
    val &= 0b11100111;
    val |= drive;

    /* Write register value back into GCONF2 register */
    wireWriteDataByte(APDS9960_GCONF2, val);
}

/**
 * @brief Définit le temps en mode basse consommation entre les détections de gestes
 * Valeur    Temps d'attente
 *   0        0,0 ms
 *   1        2,8 ms
 *   2        5,6 ms
 *   3        8,4 ms
 *   4       14,0 ms
 *   5       22,4 ms
 *   6       30,8 ms
 *   7       39,2 ms
 *
 * @param time: la valeur pour le temps d'attente
 */
void APDS9960_setGestureWaitTime(uint8_t time)
{
    uint8_t val;

    /* Read value from GCONF2 register */
    wireReadDataByte(APDS9960_GCONF2, &val);

