yasserabdoulaye92/Projet_DEEP/drivers/bsp/APDS9960/stm32g4_apds9960.c
    /* Set bits in register to given value */
    time &= 0b00000111;
    val &= 0b11111000;
    val |= time;

    /* Write register value back into GCONF2 register */
    wireWriteDataByte(APDS9960_GCONF2, val);
}

/**
 * @brief Définit le seuil bas pour les interruptions de lumière ambiante
 * @param threshold: valeur de seuil bas pour déclencher l'interruption
 */
void APDS9960_setLightIntLowThreshold(uint16_t threshold)
{
    uint8_t val_low;
    uint8_t val_high;

    /* Break 16-bit threshold into 2 8-bit values */
    val_low = threshold & 0x00FF;
    val_high = (threshold & 0xFF00) >> 8;

    /* Write low byte */
    wireWriteDataByte(APDS9960_AILTL, val_low);

    /* Write high byte */
    wireWriteDataByte(APDS9960_AILTH, val_high);
}

/**
 * @brief Définit le seuil haut pour les interruptions de lumière ambiante
 * @param threshold: valeur de seuil haut pour déclencher l'interruption
 */
void APDS9960_setLightIntHighThreshold(uint16_t threshold)
 {
     uint8_t val_low;
     uint8_t val_high;

     /* Break 16-bit threshold into 2 8-bit values */
     val_low = threshold & 0x00FF;
     val_high = (threshold & 0xFF00) >> 8;

     /* Write low byte */
     wireWriteDataByte(APDS9960_AIHTL, val_low);

     /* Write high byte */
     wireWriteDataByte(APDS9960_AIHTH, val_high);
 }

/**
 * @brief Définit le seuil bas pour les interruptions de proximité
 * @param threshold: valeur de seuil bas pour déclencher l'interruption
 */
void APDS9960_setProximityIntLowThreshold(uint8_t threshold)
{
    /* Write threshold value to register */
    wireWriteDataByte(APDS9960_PILT, threshold);
}

/**
 * @brief Définit le seuil haut pour les interruptions de proximité
 * @param threshold: valeur de seuil haut pour déclencher l'interruption
 */
void APDS9960_setProximityIntHighThreshold(uint8_t threshold)
{

    /* Write threshold value to register */
    wireWriteDataByte(APDS9960_PIHT, threshold);
}

/**
 * @brief Active ou désactive les interruptions de lumière ambiante
 * @param enable: 1 pour activer les interruptions, 0 pour les désactiver
 */
void APDS9960_setAmbientLightIntEnable(uint8_t enable)
{
    uint8_t val;

    /* Read value from ENABLE register */
    wireReadDataByte(APDS9960_ENABLE, &val);

    /* Set bits in register to given value */
    enable &= 0b00000001;
    enable = enable << 4;
    val &= 0b11101111;
    val |= enable;

    /* Write register value back into ENABLE register */
    wireWriteDataByte(APDS9960_ENABLE, val);
}

/**
 * @brief Active ou désactive les interruptions de proximité
 * @param enable: 1 pour activer les interruptions, 0 pour les désactiver
 */
void APDS9960_setProximityIntEnable(uint8_t enable)
{
    uint8_t val;

    /* Read value from ENABLE register */
    wireReadDataByte(APDS9960_ENABLE, &val);

    /* Set bits in register to given value */
    enable &= 0b00000001;
    enable = enable << 5;
    val &= 0b11011111;
    val |= enable;

    /* Write register value back into ENABLE register */
    wireWriteDataByte(APDS9960_ENABLE, val);
}

/**
 * @brief Active ou désactive les interruptions liées aux gestes
 * @param enable: 1 pour activer les interruptions, 0 pour les désactiver
 */
void APDS9960_setGestureIntEnable(uint8_t enable)
{
    uint8_t val;

    /* Read value from GCONF4 register */
    wireReadDataByte(APDS9960_GCONF4, &val);

    /* Set bits in register to given value */
    enable &= 0b00000001;
    enable = enable << 1;
    val &= 0b11111101;
    val |= enable;

    /* Write register value back into GCONF4 register */
    wireWriteDataByte(APDS9960_GCONF4, val);
}

/**
 * @brief Indique à la machine à états d'entrer ou de sortir de l'état de détection de gestes
 * @param mode: 1 pour entrer dans l'état de détection de gestes, 0 pour en sortir.
 */
void APDS9960_setGestureMode(uint8_t mode)
{
    uint8_t val;

    /* Read value from GCONF4 register */
    wireReadDataByte(APDS9960_GCONF4, &val);

    /* Set bits in register to given value */
    mode &= 0b00000001;
    val &= 0b11111110;
    val |= mode;

    /* Write register value back into GCONF4 register */
    wireWriteDataByte(APDS9960_GCONF4, val);
}

/**
 * @brief Efface l'interruption de lumière ambiante
 */
void APDS9960_clearAmbientLightInt()
{
    uint8_t throwaway;
    wireReadDataByte(APDS9960_AICLEAR, &throwaway);
}

/**
 * @brief Efface l'interruption de proximité
 */
void APDS9960_clearProximityInt(){
    uint8_t throwaway;
    wireReadDataByte(APDS9960_PICLEAR, &throwaway);
}

/* ------------------------------------------------------------- */


/* ----------------------Reading functions---------------------- */
/**
 * @brief Lit le niveau de lumière ambiante (claire) en tant que valeur sur 16 bits
 * @param val: valeur du capteur de lumière.
 */
void APDS9960_readAmbientLight(uint16_t *val) {
    uint8_t val_byte;
    *val = 0;

    /* Lit la valeur du canal clair, registre de poids faible */
    wireReadDataByte(APDS9960_CDATAL, &val_byte);
    *val = val_byte;

    /* Lit la valeur du canal clair, registre de poids fort */
    wireReadDataByte(APDS9960_CDATAH, &val_byte);
    *val = *val + ((uint16_t)val_byte << 8);
}

/**
 * @brief Lit le niveau de lumière rouge en tant que valeur sur 16 bits
 * @param val: valeur du capteur de lumière.
 */
void APDS9960_readRedLight(uint16_t *val) {
    uint8_t val_byte;
    *val = 0;

    /* Lit la valeur du canal clair, registre de poids faible */
    wireReadDataByte(APDS9960_RDATAL, &val_byte);
    *val = val_byte;

    /* Lit la valeur du canal clair, registre de poids fort */
    wireReadDataByte(APDS9960_RDATAH, &val_byte);
    *val = *val + ((uint16_t)val_byte << 8);
}

/**
 * @brief Lit le niveau de lumière verte en tant que valeur sur 16 bits
 * @param val: valeur du capteur de lumière.
 */
void APDS9960_readGreenLight(uint16_t *val) {
    uint8_t val_byte;
    *val = 0;

    /* Lit la valeur du canal clair, registre de poids faible */
    wireReadDataByte(APDS9960_GDATAL, &val_byte);
    *val = val_byte;

    /* Lit la valeur du canal clair, registre de poids fort */
    wireReadDataByte(APDS9960_GDATAH, &val_byte);
    *val = *val + ((uint16_t)val_byte << 8);
}

/**
 * @brief Lit le niveau de lumière bleue en tant que valeur sur 16 bits
 * @param val: valeur du capteur de lumière.
 */
void APDS9960_readBlueLight(uint16_t *val) {
    uint8_t val_byte;
    *val = 0;

    /* Lit la valeur du canal clair, registre de poids faible */
    wireReadDataByte(APDS9960_BDATAL, &val_byte);
    *val = val_byte;

