yasserabdoulaye92/Projet_DEEP/drivers/bsp/APDS9960/stm32g4_apds9960.c
    /* Lit la valeur du canal clair, registre de poids fort */
    wireReadDataByte(APDS9960_BDATAH, &val_byte);
    *val = *val + ((uint16_t)val_byte << 8);
}


/**
 * @brief Lit le niveau de proximité en tant que valeur sur 8 bits
 * @param val: valeur du capteur de proximité.
 */
void APDS9960_readProximity(uint8_t *val) {
    *val = 0;

    /* Read value from proximity data register */
    wireReadDataByte(APDS9960_PDATA, val);
}

/**
 * @brief Traite un événement de geste et renvoie le geste le plus probable
 * @return Nombre correspondant au geste. -1 en cas d'erreur.
 */
int APDS9960_readGesture() {
    uint8_t fifo_level = 0;
    uint8_t bytes_read = 0;
    uint8_t fifo_data[128];
    uint8_t gstatus;
    int motion;
    int i;

    /* Make sure that power and gesture is on and data is valid */
    if( !APDS9960_isGestureAvailable() || !(APDS9960_getMode() & 0b01000001) ) {
        return DIR_NONE;
    }

    while(1){

	/* Wait some time to collect next batch of FIFO data */
	HAL_Delay(FIFO_PAUSE_TIME);

	/* Get the contents of the STATUS register. Is data still valid? */
	wireReadDataByte(APDS9960_GSTATUS, &gstatus);

	/* If we have valid data, read in FIFO */
	if( (gstatus & APDS9960_GVALID) == APDS9960_GVALID ) {

		/* Read the current FIFO level */
		wireReadDataByte(APDS9960_GFLVL, &fifo_level);

#if DEBUG_APDS
		printf("FIFO Level: %d\n", fifo_level);
#endif

		/* If there's stuff in the FIFO, read it into our data block */
		if( fifo_level > 0) {
			wireReadDataBlock(APDS9960_GFIFO_U, (uint8_t*)fifo_data, (fifo_level * 4));

			bytes_read = fifo_level*4;

#if DEBUG_APDS
			printf("FIFO Dump: ");
			for ( i = 0; i < bytes_read; i++ ) {
				printf("%d ", fifo_data[i]);
			}
			printf("\n");
#endif

			/* If at least 1 set of data, sort the data into U/D/L/R */
			if( bytes_read >= 4 ) {
				for( i = 0; i < bytes_read; i += 4 ) {
					gesture_data_.u_data[gesture_data_.index] = fifo_data[i + 0];
					gesture_data_.d_data[gesture_data_.index] = fifo_data[i + 1];
					gesture_data_.l_data[gesture_data_.index] = fifo_data[i + 2];
					gesture_data_.r_data[gesture_data_.index] = fifo_data[i + 3];
					gesture_data_.index++;
					gesture_data_.total_gestures++;
				}

#if DEBUG_APDS
			printf("Up Data: ");
			for ( i = 0; i < gesture_data_.total_gestures; i++ ) {
				printf("%d ", gesture_data_.u_data[i]);
			}
			printf("\n");
#endif

				/* Filter and process gesture data. Decode near/far state */
				if( APDS9960_processGestureData() ) {
					if( APDS9960_decodeGesture() ) {
						//TODO: U-Turn Gestures
#if DEBUG_APDS
						printf("Gesture : %d", gesture_motion_);
#endif
					}
				}

				/* Reset data */
				gesture_data_.index = 0;
				gesture_data_.total_gestures = 0;
			}
		}
	} else {

		/* Determine best guessed gesture and clean up */
		HAL_Delay(FIFO_PAUSE_TIME);
		APDS9960_decodeGesture();
		motion = gesture_motion_;
#if DEBUG_APDS
		printf("END: %d\n", gesture_motion_);
#endif
		APDS9960_resetGestureParameters();
		return motion;
	}
    }
}

/**
 * @brief Lit un octet depuis le périphérique I2C et le registre spécifié
 * @param reg: le registre à lire
 * @param val: la valeur retournée depuis le registre
 */
void wireReadDataByte(uint8_t reg, uint8_t *val) {
	BSP_I2C_Read(APDS9960_I2C, APDS9960_I2C_ADDR<<1, reg, val);
}

/**
 * @brief Lit un bloc (un tableau) d'octets depuis le périphérique I2C et le registre spécifié
 * @param reg: le registre à lire
 * @param val: pointeur vers le début des données
 * @param len: nombre d'octets à lire
 */
void wireReadDataBlock(uint8_t reg, uint8_t *val, unsigned int len) {
	BSP_I2C_ReadMulti(APDS9960_I2C, APDS9960_I2C_ADDR<<1, reg, val, len);
}

/* ------------------------------------------------------------- */



/* ----------------------Writing functions---------------------- */

/**
 * @brief Écrit un octet unique dans le périphérique I2C (sans registre)
 * @param val: la valeur d'un octet à écrire dans le périphérique I2C
 */
void wireWriteByte(uint8_t val) {
	BSP_I2C_WriteNoRegister(APDS9960_I2C, APDS9960_I2C_ADDR<<1, val);
}

/**
 * @brief Écrit un octet unique dans le périphérique I2C et le registre spécifié
 * @param reg: le registre dans le périphérique I2C où écrire
 * @param val: la valeur d'un octet à écrire dans le périphérique I2C
 */
void wireWriteDataByte(uint8_t reg, uint8_t val) {
	BSP_I2C_Write(APDS9960_I2C, APDS9960_I2C_ADDR<<1, reg, val);
}

/**
 * @brief Écrit un bloc (tableau) d'octets dans le périphérique I2C et le registre spécifié
 * @param reg: le registre dans le périphérique I2C où écrire
 * @param val: pointeur vers le début du tableau d'octets de données
 * @param len: la longueur (en octets) des données à écrire
 */
void wireWriteDataBlock(uint8_t reg, uint8_t *val, unsigned int len) {
	BSP_I2C_WriteMulti(APDS9960_I2C, APDS9960_I2C_ADDR<<1, reg, val, len);
}

/* ------------------------------------------------------------- */



/* ----------------------Getting functions---------------------- */
/**
 * @brief Renvoie le seuil bas pour la détection de proximité
 * @return Seuil bas
 */
uint8_t APDS9960_getProxIntLowThresh()
{
    uint8_t val;

    /* Lire la valeur du registre PILT */
    wireReadDataByte(APDS9960_PILT, &val);

    return val;
}

/**
 * @brief Renvoie le seuil haut pour la détection de proximité
 * @return Seuil haut
 */
uint8_t APDS9960_getProxIntHighThresh()
{
    uint8_t val;

    /* Read value from PIHT register */
    wireReadDataByte(APDS9960_PIHT, &val);

    return val;
}

/**
 * @brief Renvoie la puissance d'entraînement des LED pour la proximité et ALS
 * Valeur    Courant LED
 *   0        100 mA
 *   1         50 mA
 *   2         25 mA
 *   3         12.5 mA
 *
 * @return La valeur de la puissance d'entraînement des LED. 0xFF en cas d'échec.
 */
uint8_t APDS9960_getLEDDrive()
{
    uint8_t val;

    /* Read value from CONTROL register */
    wireReadDataByte(APDS9960_CONTROL, &val);

    /* Shift and mask out LED drive bits */
    val = (val >> 6) & 0b00000011;

    return val;
}

/**
 * @brief Renvoie le gain du récepteur pour la détection de proximité
 *
 * Valeur    Gain
 *   0       1x
 *   1       2x
 *   2       4x
 *   3       8x
 *
 * @return La valeur du gain de proximité. 0xFF en cas d'échec.
 */
uint8_t APDS9960_getProximityGain()
{
    uint8_t val;

    /* Read value from CONTROL register */
    wireReadDataByte(APDS9960_CONTROL, &val);

    /* Shift and mask out PDRIVE bits */
    val = (val >> 2) & 0b00000011;

    return val;
}

/**
 * @brief Renvoie le gain du récepteur pour le capteur de lumière ambiante (ALS)
 *
 * Valeur    Gain
 *   0        1x
 *   1        4x
 *   2       16x
 *   3       64x
 *
 * @return La valeur du gain ALS. 0xFF en cas d'échec.
 */
uint8_t APDS9960_getAmbientLightGain()
{
    uint8_t val;

    /* Read value from CONTROL register */
    wireReadDataByte(APDS9960_CONTROL, &val);

    /* Shift and mask out ADRIVE bits */
    val &= 0b00000011;

    return val;
}

/**
 * @brief Obtient la valeur actuelle d'amplification du courant LED
 * Valeur  Courant amplifié
 *   0        100%
 *   1        150%
 *   2        200%
 *   3        300%
 *
 * @return La valeur d'amplification du courant LED. 0xFF en cas d'échec.
 */
uint8_t APDS9960_getLEDBoost()
{
    uint8_t val;

    /* Read value from GEXTH register */
    wireReadDataByte(APDS9960_GEXTH, &val);

    return val;
}

/**
 * @brief Obtient le gain de la photodiode pendant le mode de geste
 * Valeur    Gain
 *   0        1x
 *   1        2x
 *   2        4x
 *   3        8x
 *
 * @return le gain actuel de la photodiode. 0xFF en cas d'erreur.
 */
uint8_t APDS9960_getGestureGain()
{
    uint8_t val;

    /* Read value from GCONF2 register */
    wireReadDataByte(APDS9960_GCONF2, &val);

