yasserabdoulaye92/Projet_DEEP/drivers/bsp/APDS9960/stm32g4_apds9960.c
    /* Shift and mask out GGAIN bits */
    val = (val >> 5) & 0b00000011;

    return val;
}

/**
 * @brief Obtient le courant d'entraînement de la LED pendant le mode de geste
 *
 * Valeur    Courant de la LED
 *   0           100 mA
 *   1            50 mA
 *   2            25 mA
 *   3          12,5 mA
 *
 * @return la valeur du courant d'entraînement de la LED. 0xFF en cas d'erreur.
 */
uint8_t APDS9960_getGestureLEDDrive()
{
    uint8_t val;

    /* Read value from GCONF2 register */
    wireReadDataByte(APDS9960_GCONF2, &val);

    /* Shift and mask out GLDRIVE bits */
    val = (val >> 3) & 0b00000011;

    return val;
}

/**
 * @brief Obtient le temps en mode basse consommation entre les détections de gestes
 *
 * Valeur    Temps d'attente
 *   0            0 ms
 *   1            2,8 ms
 *   2            5,6 ms
 *   3            8,4 ms
 *   4           14,0 ms
 *   5           22,4 ms
 *   6           30,8 ms
 *   7           39,2 ms
 *
 * @return le temps d'attente actuel entre les gestes. 0xFF en cas d'erreur.
 */
uint8_t APDS9960_getGestureWaitTime()
{
    uint8_t val;

    /* Read value from GCONF2 register */
    wireReadDataByte(APDS9960_GCONF2, &val);

    /* Mask out GWTIME bits */
    val &= 0b00000111;

    return val;
}

/**
 * @brief Obtient le seuil bas pour les interruptions de lumière ambiante
 * @param threshold : seuil bas actuel stocké sur le APDS-9960
 */
void APDS9960_getLightIntLowThreshold(uint16_t *threshold)
{
    uint8_t val_byte;
    *threshold = 0;

    /* Lire la valeur depuis le registre de seuil bas de lumière ambiante, octet faible */
    wireReadDataByte(APDS9960_AILTL, &val_byte);
    *threshold = val_byte;

    /* Lire la valeur depuis le registre de seuil bas de lumière ambiante, octet fort */
    wireReadDataByte(APDS9960_AILTH, &val_byte);
    *threshold = *threshold + ((uint16_t)val_byte << 8);
}

/**
 * @brief Obtient le seuil élevé pour les interruptions de lumière ambiante
 * @param threshold : seuil élevé actuel stocké sur le APDS-9960
 */
void APDS9960_getLightIntHighThreshold(uint16_t *threshold)
{
    uint8_t val_byte;
    *threshold = 0;

    /* Lire la valeur depuis le registre de seuil élevé de lumière ambiante, octet faible */
    wireReadDataByte(APDS9960_AIHTL, &val_byte);
    *threshold = val_byte;

    /* Lire la valeur depuis le registre de seuil élevé de lumière ambiante, octet fort */
    wireReadDataByte(APDS9960_AIHTH, &val_byte);
    *threshold = *threshold + ((uint16_t)val_byte << 8);
}

/**
 * @brief Obtient le seuil bas pour les interruptions de proximité
 * @param threshold : seuil bas actuel stocké sur le APDS-9960
 */
void APDS9960_getProximityIntLowThreshold(uint8_t *threshold)
{
    *threshold = 0;

    /* Lire la valeur depuis le registre de seuil bas de proximité */
    wireReadDataByte(APDS9960_PILT, threshold);
}

/**
 * @brief Obtient le seuil élevé pour les interruptions de proximité
 * @param threshold : seuil bas actuel stocké sur le APDS-9960
 */
void APDS9960_getProximityIntHighThreshold(uint8_t *threshold)
{
    *threshold = 0;

    /* Lire la valeur depuis le registre de seuil bas de proximité */
    wireReadDataByte(APDS9960_PIHT, threshold);
}

/**
 * @brief Obtient si les interruptions de lumière ambiante sont activées ou non
 * @return 1 si les interruptions sont activées, 0 sinon. 0xFF en cas d'erreur.
 */
uint8_t APDS9960_getAmbientLightIntEnable()
{
    uint8_t val;

    /* Lire la valeur depuis le registre ENABLE */
    wireReadDataByte(APDS9960_ENABLE, &val);

    /* Décaler et masquer le bit AIEN */
    val = (val >> 4) & 0b00000001;

    return val;
}

/**
 * @brief Obtient si les interruptions de proximité sont activées ou non
 * @return 1 si les interruptions sont activées, 0 sinon. 0xFF en cas d'erreur.
 */
uint8_t APDS9960_getProximityIntEnable()
{
    uint8_t val;

    /* Lire la valeur depuis le registre ENABLE */
    wireReadDataByte(APDS9960_ENABLE, &val);

    /* Décaler et masquer le bit PIEN */
    val = (val >> 5) & 0b00000001;

    return val;
}


/**
 * @brief Obtient si les interruptions de gestes sont activées ou non
 * @return 1 si les interruptions sont activées, 0 sinon. 0xFF en cas d'erreur.
 */
uint8_t APDS9960_getGestureIntEnable()
{
    uint8_t val;

    /* Lire la valeur du registre GCONF4 */
    wireReadDataByte(APDS9960_GCONF4, &val);

    /* Décaler et masquer le bit GIEN */
    val = (val >> 1) & 0b00000001;

    return val;
}

/**
 * @brief Indique si la machine d'état des gestes est actuellement en cours d'exécution
 * @return 1 si la machine d'état des gestes est en cours d'exécution, 0 sinon. 0xFF en cas d'erreur.
 */
uint8_t APDS9960_getGestureMode()
{
    uint8_t val;

    /* Lire la valeur du registre GCONF4 */
    wireReadDataByte(APDS9960_GCONF4, &val);

    /* Masquer le bit GMODE */
    val &= 0b00000001;

    return val;
}

/**
 * @brief Obtient l'activation de la compensation du gain de proximité
 * @return 1 si la compensation est activée. 0 sinon. 0xFF en cas d'erreur.
 */
uint8_t APDS9960_getProxGainCompEnable()
{
    uint8_t val;

    /* Lire la valeur du registre CONFIG3 */
    wireReadDataByte(APDS9960_CONFIG3, &val);

    /* Décaler et masquer les bits PCMP */
    val = (val >> 5) & 0b00000001;

    return val;
}

/**
 * @brief Obtient le masque actuel pour les photodiodes de proximité activées/désactivées
 *
 * 1 = désactivé, 0 = activé
 * Bit    Photodiode
 *  3       UP
 *  2       DOWN
 *  1       LEFT
 *  0       RIGHT
 *
 * @return Masque de proximité actuel pour les photodiodes. 0xFF en cas d'erreur.
 */
uint8_t APDS9960_getProxPhotoMask()
{
    uint8_t val;

    /* Lire la valeur du registre CONFIG3 */
    wireReadDataByte(APDS9960_CONFIG3, &val);

    /* Masquer les bits de masque d'activation des photodiodes */
    val &= 0b00001111;

    return val;
}

/**
 * @brief Obtient le seuil de proximité d'entrée actuel pour la détection des gestes
 * @return Seuil de proximité d'entrée actuel.
 */
uint8_t APDS9960_getGestureEnterThresh()
{
    uint8_t val;

    /* Lire la valeur du registre GPENTH */
    wireReadDataByte(APDS9960_GPENTH, &val);

    return val;
}

/**
 * @brief Obtient le seuil de proximité de sortie actuel pour la détection des gestes
 * @return Seuil de proximité de sortie actuel.
 */
uint8_t APDS9960_getGestureExitThresh()
{
    uint8_t val;

    /* Lire la valeur du registre GEXTH */
    wireReadDataByte(APDS9960_GEXTH, &val);

    return val;
}


/* ------------------------------------------------------------- */



/**
 * @brief Traite les données brutes du geste pour déterminer la direction du balayage
 * @return true si l'état proche ou loin est détecté. false sinon.
 */
bool APDS9960_processGestureData() {
    uint8_t u_first = 0;
    uint8_t d_first = 0;
    uint8_t l_first = 0;
    uint8_t r_first = 0;
    uint8_t u_last = 0;
    uint8_t d_last = 0;
    uint8_t l_last = 0;
    uint8_t r_last = 0;
    int ud_ratio_first;
    int lr_ratio_first;
    int ud_ratio_last;
    int lr_ratio_last;
    int ud_delta;
    int lr_delta;
    int i;

    /* If we have less than 4 total gestures, that's not enough */
    if( gesture_data_.total_gestures <= 4 ) {
        return false;
    }

